IDEA StatiCa Open Model
ConcreteSLSCheckResultStiffness Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The ConcreteSLSCheckResultStiffness type exposes the following members.
Properties
Name | Description
Fr
 crack resistance internal forces
CharacteristicsI
 stiffnesses calculated on uncracked cross-section
CharacteristicsII
 stiffnesses calculated on cracked cross-section
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
LinearStiffness
 linear stiffnesses
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Stiffness
 result stiffnesses
StiffnessI
 stiffnesses calculated on uncracked cross-section
StiffnessII
 stiffnesses calculated on fully-cracked cross-section
Top
See Also
Reference
ConcreteSLSCheckResultStiffness Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace